export interface Job {
  id: string;
  title: string;
  location: string;
  salary: string;
  type: string;
  vacancies: number;
  deadline?: string;
  description: string;
}

export const jobs: Job[] = [
  {
    id: '1',
    title: 'Sales person',
    location: 'New Road',
    salary: 'NRs 15,000 - 20,000/month',
    type: 'Full-time',
    vacancies: 10,
    deadline: 'March 15, 2026',
    description: 'ग्राहकसँग समन्वय गरी कम्पनीका उत्पादन वा सेवाहरूको प्रचार–प्रसार र बिक्री गर्ने जिम्मेवारी।',
  },
  {
    id: '2',
    title: 'Security Guard',
    location: 'Inside valley',
    salary: 'Nrs 22,000 - 25,000/month',
    type: 'Full-time',
    vacancies: 20,
    deadline: 'February 28, 2026',
    description: 'परिसर तथा सम्पत्तिको सुरक्षा गर्दै नियम–कानुन पालना गराउने जिम्मेवारी।',
  },
  {
    id: '3',
    title: 'Cook ',
    location: 'Kathmandu, Lalitpur, Bhaktapur',
    salary: 'होटलका नियम–कानुनअनुसार',
    type: 'Full-time',
    vacancies: 15,
    deadline: 'March 30, 2026',
    description: 'अनुभवी कुकका लागि आकर्षक उच्च तलब, फ्रेशरका लागि पनि राम्रो तलब र सिक्ने अवसर सहित कुक आवश्यक।',
  },
  {
    id: '4',
    title: 'Kitchen Helper',
    location: 'Inside valley',
    salary: 'Nrs 12,000 - 17,000/month',
    type: 'Full-time',
    vacancies: 10,
    deadline: 'February 20, 2026',
    description: 'किचन हेल्पर आवश्यक 🍽️ — खान्ने–बस्ने सुविधा सहित, फ्रेशर र अनुभवी दुवैका लागि राम्रो अवसर।',
  },
  {
    id: '5',
    title: 'Barista',
    location: 'Inside valley',
    salary: 'Nrs 18,000 - 22,000/month',
    type: 'Full-time',
    vacancies: 15-20,
    deadline: 'April 10, 2026',
    description: 'बारिस्टा आवश्यक ☕ — कफी बनाउने सीप भएकालाई प्राथमिकता, फ्रेशरका लागि पनि अवसर र आकर्षक तलब।',
  },
  {
    id: '6',
    title: 'Delivery Boy',
    location: 'Dallu',
    salary: 'Nrs 20,000 ',
    type: 'Contract',
    vacancies: 1,
    deadline: 'March 5, 2026',
    description: 'इलेक्ट्रिक स्कुटर चलाउन जान्नुहुन्छ? ⚡🛵 अनुभव भए/नभए पनि मौका — राम्रो तलब + डेलिभरी इन्सेन्टिभ!',
  },
];
